SiliconLabs/wfx-fullMAC-tools/Examples/SiliconLabs/multiprotocol/bare_metal/EFR32MG12/src/wifi/lwip_bm.c
static char const *ssi_tags[] = {
  "leds_state",
  "scan_list",
  "softap_state",
  "softap_ssid",
  "softap_ip",
  "softap_mac",
  "softap_secu",
  "softap_channel",
  "clients_list",
  "station_state",
  "station_ip",
  "station_mac",
  "ap_ssid",
  "ap_mac",
  "ap_secu",
  "ap_channel",
  "event",
  "ble_state",
  "ble_name",
  "ble_mac",
  "master_list"
};

/***************************************************************************//**
 * @brief Initialize the web server CGI handlers
 ******************************************************************************/
static void cgi_ssi_init(void)
{
  //give the CGI and SSI tables to the HTTP server
  http_set_cgi_handlers(cgi_table, sizeof(cgi_table)/sizeof (tCGI));
  http_set_ssi_handler(ssi_handler, ssi_tags, sizeof(ssi_tags)/sizeof(char *));
}

/***************************************************************************//**
 * @brief Web server CGI handler for controlling the LEDs.
 ******************************************************************************/
static const char *toggle_leds_cgi_handler (int index,
                                            int num_params,
                                            char *pc_param[],
                                            char *pc_value[])
{
  interface_light_toggle(interface_light_trigger_src_wifi,
                         (interface_mac_t *)wifi.mac_addr_1.octet);

  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to get the LED states.
 ******************************************************************************/
static const char *get_leds_state_cgi_handler (int index,
                                               int num_params,
                                               char *pc_param[],
                                               char *pc_value[])
{
  return "/leds_state.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to get the interface states.
 ******************************************************************************/
static const char *get_interface_states_cgi_handler(int index,
                                                    int num_params,
                                                    char *pc_param[],
                                                    char *pc_value[])
{
  return "/interface_states.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to start the BLE advertising.
 ******************************************************************************/
static const char *start_ble_advertising_cgi_handler(int index,
                                                     int num_params,
                                                     char *pc_param[],
                                                     char *pc_value[])
{
  bluetooth_app_start_advertising();
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to stop the BLE advertising.
 ******************************************************************************/
static const char *stop_ble_advertising_cgi_handler(int index,
                                                    int num_params,
                                                    char *pc_param[],
                                                    char *pc_value[])
{
  bluetooth_app_stop_advertising();
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to disconnect the BLE master.
 ******************************************************************************/
static const char *disconnect_ble_master_cgi_handler(int index,
                                                     int num_params,
                                                     char *pc_param[],
                                                     char *pc_value[])
{
  printf("Disconnect BLE\r\n");
  bluetooth_app_disconnect_master();
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to start the station interface.
 ******************************************************************************/
static const char *start_station_cgi_handler(int index,
                                             int num_params,
                                             char *pc_param[],
                                             char *pc_value[])
{
  sl_status_t status;
  int ssid_length = 0, passkey_length = 0;

  if (num_params == 3) {
    if (strcmp(pc_param[0], "ssid") == 0)
    {
      url_decode(pc_value[0]);
      ssid_length = strlen(pc_value[0]);
      memset(wlan_ssid, 0, 32);
      strncpy(wlan_ssid, pc_value[0], ssid_length);
    }
    if (strcmp(pc_param[1], "pwd") == 0)
    {
      url_decode(pc_value[1]);
      passkey_length = strlen(pc_value[1]);
      memset(wlan_passkey, 0, 64);
      strncpy(wlan_passkey, pc_value[1], passkey_length);
    }
    if (strcmp(pc_param[2], "secu") == 0)
    {
      url_decode(pc_value[2]);
      if ((strcmp(pc_value[2], "WPA2") == 0) || (strcmp(pc_value[2], "WPA") == 0))
      {
        wlan_security = WFM_SECURITY_MODE_WPA2_WPA1_PSK;
      }else if (strcmp(pc_value[2], "WEP") == 0)
      {
        wlan_security = WFM_SECURITY_MODE_WEP;
      }else if (strcmp(pc_value[2], "OPEN") == 0)
      {
        wlan_security = WFM_SECURITY_MODE_OPEN;
      }
    }
    if (!(wifi.state & SL_WFX_STA_INTERFACE_CONNECTED))
    {
      status = sl_wfx_send_join_command((uint8_t*) wlan_ssid, ssid_length,
                                        NULL, 0, wlan_security, 0, 0,
                                        (uint8_t*) wlan_passkey, passkey_length,
                                        NULL, 0);
      if (status != SL_STATUS_OK) {
        printf("Connection command error\r\n");
        strcpy(event_log, "Connection command error");
      } else {
        //if connected, latch the MAC address and the channel from the scan list
        for (uint16_t i = 0; i < SL_WFX_MAX_SCAN_RESULTS; i++) {
          if (strcmp((char *) scan_list[i].ssid_def.ssid, wlan_ssid) == 0) {
           ap_channel = scan_list[i].channel;
            memcpy(&ap_mac, scan_list[i].mac, SL_WFX_BSSID_SIZE);
          }
        }
      }
    }
  }else{
    printf("Invalid Connection Request\r\n");
    strcpy(event_log, "Invalid Connection Request");
  }

  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to stop the station interface.
 ******************************************************************************/
static const char *stop_station_cgi_handler(int index,
                                            int num_params,
                                            char *pc_param[],
                                            char *pc_value[])
{
  sl_wfx_send_disconnect_command();

  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to start the softAP interface.
 ******************************************************************************/
static const char *start_softap_cgi_handler(int index,
                                            int num_params,
                                            char *pc_param[],
                                            char *pc_value[])
{
  sl_wfx_start_ap_command(softap_channel, (uint8_t*) softap_ssid,
                          strlen(softap_ssid), 0, 0, softap_security,
                          0, (uint8_t*) softap_passkey, strlen(softap_passkey),
                          NULL, 0, NULL, 0);
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to start the softAP interface.
 ******************************************************************************/
static const char *stop_softap_cgi_handler(int index,
                                           int num_params,
                                           char *pc_param[],
                                           char *pc_value[])
{
  sl_wfx_stop_ap_command();
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to disconnect a client from the softAP
 * interface.
 ******************************************************************************/
static const char *disconnect_client_cgi_handler(int index,
                                                 int num_params,
                                                 char *pc_param[],
                                                 char *pc_value[])
{
  sl_wfx_mac_address_t mac_address;
  const char separator[] = ":";
  char *mac_byte = NULL;

  for (uint16_t i = 0; i < num_params; i++) {
    if (strcmp(pc_param[i], "mac") == 0)
    {
      mac_byte = strtok(pc_value[i], separator);
      for(uint8_t j = 0; j < 6; j++)
      {
        mac_address.octet[j] = (uint8_t)strtoul(mac_byte, NULL, 16);
        mac_byte = strtok(NULL, separator);
      }
      sl_wfx_disconnect_ap_client_command(&mac_address);
    }
  }

  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to start a scan.
 ******************************************************************************/
static const char *start_scan_cgi_handler(int index,
                                          int num_params,
                                          char *pc_param[],
                                          char *pc_value[])
{
  sl_status_t result;

