SiliconLabs/wfx-fullMAC-tools/Examples/SiliconLabs/multiprotocol/bare_metal/EFR32MG12/src/wifi/lwip_bm.c
  // Reset scan list
  scan_count = 0;
  scan_count_saved = 0;
  memset(scan_list, 0, sizeof(scan_result_list_t) * SL_WFX_MAX_SCAN_RESULTS);

  // perform a scan on every Wi-Fi channel in active mode
  result = sl_wfx_send_scan_command(WFM_SCAN_MODE_ACTIVE,
                                    NULL,
                                    0,
                                    NULL,
                                    0,
                                    NULL,
                                    0,
                                    NULL);
  if ((result == SL_STATUS_OK) || (result == SL_STATUS_WIFI_WARNING))
  {
    sl_wfx_host_setup_waited_event(SL_WFX_SCAN_COMPLETE_IND_ID);
    result = sl_wfx_host_wait_for_confirmation(SL_WFX_SCAN_COMPLETE_IND_ID,
                                      SL_WFX_DEFAULT_REQUEST_TIMEOUT_MS,
                                      NULL);
  }

  return "/scan_results.json";
}

static uint16_t ssi_handler(int index, char *pc_insert, int insert_len)
{
  int value, result = 0;
  char string_field[HTTP_MAX_ITEM_LENGTH];
  char client_name[9] = {'C', 'l', 'i', 'e', 'n', 't', ' ', ' ', '\0'};

  pc_insert[0] = 0;

  switch (index) {
    case 0: // <!--#leds_state-->
      value = interface_light_get_state();
      result = snprintf(pc_insert, 2, "%d", value);
      break;
    case 1: // <!--#scan_list-->
      for (int i = 0; i < scan_count_saved; i++) {
        value = snprintf(string_field, HTTP_MAX_ITEM_LENGTH, "{\"ssid\":\"%s\", \"rssi\":\"%d\", \"secu\":\"%s\"},",
                          (char *)((strlen((char *) scan_list[i].ssid_def.ssid) != 0) ? \
                              (char*)scan_list[i].ssid_def.ssid : "Hidden"),
                              ((int16_t)(scan_list[i].rcpi - 220)/2),
                              (scan_list[i].security_mode.wpa2) ? "WPA2" : \
                                  ((scan_list[i].security_mode.wpa) ? "WPA" : \
                                      ((scan_list[i].security_mode.wep) ? "WEP": "OPEN")));
        if ((value > 0) && (value < HTTP_MAX_ITEM_LENGTH)) {
          // Item format Ok, check that it doesn't exceed the response size before concatenating it
          if ((result + value) < LWIP_HTTPD_MAX_TAG_INSERT_LEN) {
            strcat(pc_insert, string_field);
            result += value;
          } else {
            // HTTP response size exceeded, exit the loop and send what is possible
            break;
          }
        }
      }
      // Strip the last comma
      if (pc_insert[result-1] == ',') {
        pc_insert[result-1] = '\0';
        result -= 1;
      }
      break;
    case 2: // <!--#softap_state-->
      if (wifi.state & SL_WFX_AP_INTERFACE_UP) {
        result = snprintf(pc_insert, 2, "1");
      } else {
        result = snprintf(pc_insert, 2, "0");
      }
      break;
    case 3: // <!--#softap_ssid-->
      result = snprintf(pc_insert, 32, "%s", softap_ssid);
      break;
    case 4: // <!--#softap_ip-->
      result = sprintf(pc_insert, "%d.%d.%d.%d",
                       (int)(ap_netif.ip_addr.addr & 0xff),
                       (int)((ap_netif.ip_addr.addr >> 8) & 0xff),
                       (int)((ap_netif.ip_addr.addr >> 16) & 0xff),
                       (int)((ap_netif.ip_addr.addr >> 24) & 0xff));
      break;
    case 5: // <!--#softap_mac-->
      result = sprintf(pc_insert,
                       "%02X:%02X:%02X:%02X:%02X:%02X",
                       wifi.mac_addr_1.octet[0],
                       wifi.mac_addr_1.octet[1],
                       wifi.mac_addr_1.octet[2],
                       wifi.mac_addr_1.octet[3],
                       wifi.mac_addr_1.octet[4],
                       wifi.mac_addr_1.octet[5]);
      break;
    case 6: // <!--#softap_secu-->
      if(softap_security == WFM_SECURITY_MODE_OPEN)                result = sprintf(pc_insert, "OPEN");
      else if(softap_security == WFM_SECURITY_MODE_WEP)            result = sprintf(pc_insert, "WEP");
      else if(softap_security == WFM_SECURITY_MODE_WPA2_WPA1_PSK)  result = sprintf(pc_insert, "WPA1/WPA2");
      else if(softap_security == WFM_SECURITY_MODE_WPA2_PSK)       result = sprintf(pc_insert, "WPA2");
      break;
    case 7: // <!--#softap_channel-->
      result = sprintf(pc_insert, "%d", softap_channel);
      break;
    case 8: // <!--#clients_list-->
      for(uint8_t i = 0; i < DHCPS_MAX_CLIENT; i++) {
        struct eth_addr mac;
        dhcpserver_get_mac(i, &mac);
        if (!(mac.addr[0] == 0 && mac.addr[1] == 0 &&
            mac.addr[2] == 0 && mac.addr[3] == 0 &&
            mac.addr[4] == 0 && mac.addr[5] == 0)) {
          ip_addr_t ip_addr = dhcpserver_get_ip(&mac);
          // Add an index to the client name
          client_name[7] = i + 1 + 0x30;

          value = snprintf(string_field, HTTP_MAX_ITEM_LENGTH,
                           "{\"name\":\"%s\", \"ip\":\"%d.%d.%d.%d\", \"mac\":\"%02X:%02X:%02X:%02X:%02X:%02X\"},",
                           client_name,
                           (int)(ip_addr.addr & 0xff),
                           (int)((ip_addr.addr >> 8) & 0xff),
                           (int)((ip_addr.addr >> 16) & 0xff),
                           (int)((ip_addr.addr >> 24) & 0xff),
                           mac.addr[0],
                           mac.addr[1],
                           mac.addr[2],
                           mac.addr[3],
                           mac.addr[4],
                           mac.addr[5]);

          if ((value > 0) && (value < HTTP_MAX_ITEM_LENGTH)) {
            // Item format Ok, check that it doesn't exceed the response size before concatenating it
            if ((result + value) < LWIP_HTTPD_MAX_TAG_INSERT_LEN) {
              strcat(pc_insert, string_field);
              result += value;
            } else {
              // HTTP response size exceeded, exit the loop and send what is possible
              break;
            }
          }
        }
      }
      // Strip the last comma
      if (pc_insert[result-1] == ',') {
        pc_insert[result-1] = '\0';
        result -= 1;
      }
      break;
    case 9: /* <!--#station_state--> */
      if (wifi.state & SL_WFX_STA_INTERFACE_CONNECTED) {
        result = snprintf(pc_insert, 2, "1");
      } else {
        result = snprintf(pc_insert, 2, "0");
      }
      break;
    case 10: /* <!--#station_ip--> */
      result = sprintf(pc_insert, "%d.%d.%d.%d",
                       (int)(sta_netif.ip_addr.addr & 0xff),
                       (int)((sta_netif.ip_addr.addr >> 8) & 0xff),
                       (int)((sta_netif.ip_addr.addr >> 16) & 0xff),
                       (int)((sta_netif.ip_addr.addr >> 24) & 0xff));
      break;
    case 11: /* <!--#station_mac--> */
      result = sprintf(pc_insert,
                       "%02X:%02X:%02X:%02X:%02X:%02X",
                       wifi.mac_addr_0.octet[0],
                       wifi.mac_addr_0.octet[1],
                       wifi.mac_addr_0.octet[2],
                       wifi.mac_addr_0.octet[3],
                       wifi.mac_addr_0.octet[4],
                       wifi.mac_addr_0.octet[5]);
      break;
    case 12: /* <!--#ap_ssid--> */
      result = snprintf(pc_insert, 32, "%s", wlan_ssid);
      break;
    case 13: /* <!--#ap_mac--> */
      result = sprintf(pc_insert,
                       "%02X:%02X:%02X:%02X:%02X:%02X",
                       ap_mac.addr[0],
                       ap_mac.addr[1],
                       ap_mac.addr[2],
                       ap_mac.addr[3],
                       ap_mac.addr[4],
                       ap_mac.addr[5]);
      break;
    case 14: // <!--#ap_secu-->
      if(wlan_security == WFM_SECURITY_MODE_OPEN)                result = sprintf(pc_insert, "OPEN");
      else if(wlan_security == WFM_SECURITY_MODE_WEP)            result = sprintf(pc_insert, "WEP");
      else if(wlan_security == WFM_SECURITY_MODE_WPA2_WPA1_PSK)  result = sprintf(pc_insert, "WPA1/WPA2");
      else if(wlan_security == WFM_SECURITY_MODE_WPA2_PSK)       result = sprintf(pc_insert, "WPA2");
      break;
    case 15: // <!--#ap_channel-->
      result = sprintf(pc_insert, "%d", ap_channel);
      break;
    case 16: /* <!--#event--> */
      result = sprintf(pc_insert, "%s", event_log);
      strcpy(event_log, "");
      break;
    case 17: // <!--#ble_state-->
      value = bluetooth_app_get_ble_state();
      result = snprintf(pc_insert, 2, "%d", value);
      break;
    case 18: // <!--#ble_name-->
      bluetooth_app_get_own_name(pc_insert, LWIP_HTTPD_MAX_TAG_INSERT_LEN);
      result = strlen(pc_insert);
      break;
    case 19: // <!--#ble_mac-->
    {
      bd_addr ble_id = {0};
      bluetooth_app_get_own_mac(&ble_id);
      result = sprintf(pc_insert,
                       "%02X:%02X:%02X:%02X:%02X:%02X",
                       ble_id.addr[5],
                       ble_id.addr[4],
                       ble_id.addr[3],
                       ble_id.addr[2],
                       ble_id.addr[1],
                       ble_id.addr[0]);
      break;
    }
    case 20: // <!--#master_list-->
    {
      bd_addr master_id = {0};
      int res = bluetooth_app_get_master_mac(&master_id);
      if (res == 0) {
        bluetooth_app_get_master_name(string_field, HTTP_MAX_ITEM_LENGTH);
        result = sprintf(pc_insert,
                         "{\"name\":\"%s\",\"mac\":\"%02X:%02X:%02X:%02X:%02X:%02X\"}",
                         string_field,
                         master_id.addr[5],
                         master_id.addr[4],
                         master_id.addr[3],
                         master_id.addr[2],
                         master_id.addr[1],
                         master_id.addr[0]);
      }
      break;
    }
    default:
      // Error, unsupported Id
      break;
  }

  return result;
}

/***************************************************************************//**
 * @brief Converts a hex character to its integer value
 *
 * @param ch Character to convert to integer.
 * @returns Returns integer result.
 ******************************************************************************/
static char from_hex(char ch)
{
  return isdigit(ch) ? ch - '0' : tolower(ch) - 'a' + 10;
}

/***************************************************************************//**
 * @brief Returns a url-decoded version of the string str
 *
 * @param str String to decode.
 * @returns Success or fail.
 ******************************************************************************/
static sl_status_t url_decode(char *str)
{
  char *pstr = str, rstr[64];
  int i = 0;

  if (strlen(str) > 64) {
    return SL_STATUS_FAIL;
  }

  while (*pstr) {
    if (*pstr == '%') {
      if (pstr[1] && pstr[2]) {
        rstr[i++] = from_hex(pstr[1]) << 4 | from_hex(pstr[2]);
        pstr += 2;
      }
    } else if (*pstr == '+') {
      rstr[i++]  = ' ';
    } else {
      rstr[i++] = *pstr;
    }
    pstr++;
  }
  rstr[i] = '\0';
  strcpy(str, &rstr[0]);
  return SL_STATUS_OK;
}

#endif

#ifdef LWIP_IPERF_SERVER
/***************************************************************************//**
 * @brief Function to handle iperf results report
 ******************************************************************************/
static void lwip_iperf_results(void *arg, enum lwiperf_report_type report_type,
                               const ip_addr_t* local_addr, u16_t local_port, const ip_addr_t* remote_addr, u16_t remote_port,
                               u32_t bytes_transferred, u32_t ms_duration, u32_t bandwidth_kbitpsec)
{
  printf("\r\nIperf Server Report:\r\n");
  printf("Interval %d.%d sec\r\n", (int)(ms_duration / 1000), (int)(ms_duration % 1000));
  printf("Bytes transferred %d.%dMBytes\r\n", (int)(bytes_transferred / 1024 / 1024), (int)((((bytes_transferred / 1024) * 1000) / 1024) % 1000));
  printf("Bandwidth %d.%d Mbits/sec\r\n\r\n", (int)(bandwidth_kbitpsec / 1024), (int)(((bandwidth_kbitpsec * 1000) / 1024) % 1000));
}

#endif

/***************************************************************************//**
 * Initialize and start LwIP stack.
 ******************************************************************************/
int lwip_bm_init (void)
{
  int res;

