SiliconLabs/wfx-fullMAC-tools/Examples/SiliconLabs/multiprotocol/bare_metal/EFR32MG12/src/wifi/lwip_bm.c
  // Initialize the LwIP stack without RTOS
  lwip_init();

  // Initialize the LwIP stack
  res = netif_config();

#ifdef LWIP_HTTP_SERVER
  // Initialize web server demo
  httpd_init();
  // Initialize the CGI handlers
  cgi_ssi_init();
#endif
#ifdef LWIP_IPERF_SERVER
  lwiperf_start_tcp_server_default(lwip_iperf_results, 0);
#endif

  return res;
}

/**************************************************************************//**
 * Set station link status to up.
 *****************************************************************************/
sl_status_t lwip_set_sta_link_up(void)
{
  netif_set_up(&sta_netif);
  netif_set_link_up(&sta_netif);
  if (use_dhcp_client) {
    dhcp_start(&sta_netif);
    print_addr = 1;
  }
  return SL_STATUS_OK;
}
/**************************************************************************//**
 * Set station link status to down.
 *****************************************************************************/
sl_status_t lwip_set_sta_link_down(void)
{
  if (use_dhcp_client) {
    dhcp_stop(&sta_netif);
  }
  netif_set_link_down(&sta_netif);
  netif_set_down(&sta_netif);

  if ((wifi.state & SL_WFX_AP_INTERFACE_UP) == 0) {
    interface_display_wifi_state(false);
  }
  return SL_STATUS_OK;
}
/**************************************************************************//**
 * Set AP link status to up.
 *****************************************************************************/
sl_status_t lwip_set_ap_link_up(void)
{
  netif_set_up(&ap_netif);
  netif_set_link_up(&ap_netif);
  dhcpserver_start();
  return SL_STATUS_OK;
}

/**************************************************************************//**
 * Enable DHCP client.
 *****************************************************************************/
void lwip_enable_dhcp_client(void)
{
  use_dhcp_client = 1;
}

/**************************************************************************//**
 * Disable DHCP client.
 *****************************************************************************/
void lwip_disable_dhcp_client(void)
{
  use_dhcp_client = 0;
}

/**************************************************************************//**
 * Set AP link status to down.
 *****************************************************************************/
sl_status_t lwip_set_ap_link_down(void)
{
  dhcpserver_stop();
  netif_set_link_down(&ap_netif);
  netif_set_down(&ap_netif);

  if ((wifi.state & SL_WFX_STA_INTERFACE_CONNECTED) == 0) {
    interface_display_wifi_state(false);
  }
  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Initializes LwIP network interface.
 ******************************************************************************/
static int netif_config(void)
{
  sl_status_t status;
  ip_addr_t ap_ipaddr, ap_netmask, ap_gw;
  ip_addr_t sta_ipaddr, sta_netmask, sta_gw;
  int res = -1;
  bool wfx_init_ok = false;

  if (use_dhcp_client) {
    ip_addr_set_zero_ip4(&sta_ipaddr);
    ip_addr_set_zero_ip4(&sta_netmask);
    ip_addr_set_zero_ip4(&sta_gw);
  } else {
    IP_ADDR4(&sta_ipaddr, sta_ip_addr0, sta_ip_addr1, sta_ip_addr2, sta_ip_addr3);
    IP_ADDR4(&sta_netmask, sta_netmask_addr0, sta_netmask_addr1, sta_netmask_addr2, sta_netmask_addr3);
    IP_ADDR4(&sta_gw, sta_gw_addr0, sta_gw_addr1, sta_gw_addr2, sta_gw_addr3);
  }

  /* Initialize the SoftAP information */
  IP_ADDR4(&ap_ipaddr, ap_ip_addr0, ap_ip_addr1, ap_ip_addr2, ap_ip_addr3);
  IP_ADDR4(&ap_netmask, ap_netmask_addr0, ap_netmask_addr1, ap_netmask_addr2, ap_netmask_addr3);
  IP_ADDR4(&ap_gw, ap_gw_addr0, ap_gw_addr1, ap_gw_addr2, ap_gw_addr3);

  /* Initialize the WF200 used by the two interfaces */
  status = sl_wfx_init(&wifi);
  printf("FMAC Driver version    %s\r\n", FMAC_DRIVER_VERSION_STRING);
  switch (status) {
    case SL_STATUS_OK:
      wifi.state = SL_WFX_STARTED;
      printf("WF200 Firmware version %d.%d.%d\r\n",
             wifi.firmware_major,
             wifi.firmware_minor,
             wifi.firmware_build);
      printf("WF200 initialization successful\r\n");
      wfx_init_ok = true;
      break;
    case SL_STATUS_WIFI_INVALID_KEY:
      printf("Failed to init WF200: Firmware keyset invalid\r\n");
      break;
    case SL_STATUS_WIFI_FIRMWARE_DOWNLOAD_TIMEOUT:
      printf("Failed to init WF200: Firmware download timeout\r\n");
      break;
    case SL_STATUS_TIMEOUT:
      printf("Failed to init WF200: Poll for value timeout\r\n");
      break;
    case SL_STATUS_FAIL:
      printf("Failed to init WF200: Error\r\n");
      break;
    default:
      printf("Failed to init WF200: Unknown error\r\n");
  }

  if (wfx_init_ok) {
    // Add station and softAP interfaces
    netif_add(&sta_netif, &sta_ipaddr, &sta_netmask, &sta_gw, NULL, &sta_ethernetif_init, &ethernet_input);
    netif_add(&ap_netif, &ap_ipaddr, &ap_netmask, &ap_gw, NULL, &ap_ethernetif_init, &ethernet_input);

    //  Registers the default network interface.
    netif_set_default(&ap_netif);

    sl_wfx_start_ap_command(softap_channel, (uint8_t*) softap_ssid,
                            strlen(softap_ssid), 0, 0, softap_security, 0,
                            (uint8_t*) softap_passkey, strlen(softap_passkey),
                            NULL, 0, NULL, 0);
    printf ("IP address : %d.%d.%d.%d\r\n",
            ap_ip_addr0,
            ap_ip_addr1,
            ap_ip_addr2,
            ap_ip_addr3);

    interface_display_wifi_state(true);
    res = 0;
  }

  return res;
}

/***************************************************************************//**
 * @brief
 *    LwIP main loop
 *
 * @param[in]
 *    none
 *
 * @return
 *    none
 ******************************************************************************/
void lwip_bm_process(void)
{
  sys_check_timeouts();
}

